
#include "include.h"

std::wstring analysis_alphabet = L"абвгґдеєжзиіїйклмнопрстуфхцчшщьюя";

std::wstring alphabet = L"абвгґдеєжзиіїйклмнопрстуфхцчшщьюя"; 

wchar_t ukr_common[33] = 
{
    L'о', L'а', L'н', L'и', L'і',
    L'т', L'в', L'р', L'е', L'с',
    L'у', L'л', L'д', L'к', L'м',
    L'п', L'я', L'з', L'ь', L'б',
    L'г', L'ч', L'й', L'х', L'ж',
    L'ю', L'є', L'ш', L'ц', L'ї',
    L'ф', L'щ', L'ґ', 
};

std::map<wchar_t, double> ukr_freqs = {
    {L'о', 0.094}, {L'а', 0.072}, {L'н', 0.065}, {L'и', 0.061}, {L'і', 0.057},
    {L'т', 0.055}, {L'в', 0.052}, {L'р', 0.048}, {L'е', 0.046}, {L'с', 0.041},
    {L'у', 0.040}, {L'л', 0.036}, {L'д', 0.035}, {L'к', 0.035}, {L'м', 0.031},
    {L'п', 0.029}, {L'я', 0.024}, {L'з', 0.023}, {L'ь', 0.018}, {L'б', 0.017},
    {L'г', 0.016}, {L'ч', 0.014}, {L'й', 0.013}, {L'х', 0.012}, {L'ж', 0.009},
    {L'ю', 0.008}, {L'є', 0.008}, {L'ш', 0.007}, {L'ц', 0.006}, {L'ї', 0.006},
    {L'ф', 0.003}, {L'щ', 0.001}, {L'ґ', 0.001}
};